Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator class defines a manipulator to display and manipulate angle value text.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.Structures.Geometry3d.LineSegment,System.Double)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator class.
manipulationContext: The manipulation context.
placement: The placement of the text manipulator.
initialValue: The initial value.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator.AngleEntered
Invoked when an angle has been entered.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator.Value
Gets or sets the value of the angle.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator.AttachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator.DetachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.AngleTextManipulator.OnAngleEntered(System.Object,System.Double)
Event handler for the angle entered event.
sender: The sender object.
eventArgs: The event arguments.